###########이항분포의 확률##########################################
# 10번의 복원추출해서 3개의 빨간공
dbinom(3, 10, 0.3)

dbinom(3, 10, 0.2)

# 20번의 복원추출해서 6개의 빨간공
dbinom(6, 20, 0.3)

# 20개중 2개불량 p = 0.1
p = c(0.1, 0.14, 0.15, 0.18, 0.22)
dbinom(2, 20, p)

dbinom(2, 20, p)*0.2

sum(dbinom(2, 20, p)*0.2)

dbinom(2, 20, p)*0.2 / sum(dbinom(2, 20, p)*0.2)

sum(dbinom(2, 20, p)*0.2 / sum(dbinom(2, 20, p)*0.2))

#########정규분포의 확률############################################

mu <- c(900, 960, 1000, 1040, 1100)
lkhd <- pnorm(900.5, mu, 40) - pnorm(899.5, mu, 40)
round(lkhd*0.2, 5)

round(lkhd*0.2 / sum(lkhd*0.2), 5)

